---
kind: type
id: T:Autodesk.Revit.DB.Electrical.Conduit
zh: 线管
source: html/9c0ba59c-fccf-a502-e1d1-d674cc060682.htm
---
# Autodesk.Revit.DB.Electrical.Conduit

**中文**: 线管

This class represents a conduit in Autodesk Revit.

## Syntax (C#)
```csharp
public class Conduit : CableTrayConduitBase
```